var treeData = [
  {
    "name": "النبي صلى الله عليه وسلم",
    "parent": "null",
    "children": [//d.children are visible, d._children are hidden.
				 //on click, the data is switched between the 2 vars
      {//1
        "name": "ابو هريرة",
		'url':''
        ,"_children": [
          {//1
            "name": "ذكوان أبو صالح",
            "parent": "ابو هريرة",
			'url': '',
            "_children": [
              {//1 
                "name":   "سهيل بن أبي صالح",
                 "url": ""
              },
			  {//2
				'name': 'الأعمش سليمان بن مهران',
				'url': ''
			  }
 
            ]
         },
          {//2
            "name": "أبو سلمة بن عبد الرحمان بن عوف",
			'url':''
            ,"_children": [
             {//1
                "name":   "ابن شهاب الزهري",
                 "url": ""
              },

              {//2
                "name":   "محمد بن عمرو بن علقمة",
                 "url": ""
              },
            ]
          },
          {//3
            "name": "عبد الرحمان الأعرج",
			'url': ''
            ,"_children": [
              {  //1
                "name":   "أبو الزناد",
                 "url": ""
              },
			  {//2
				'name': 'ابن شهاب الزهري',
				'url':''
			  }
            ]

          },
          {//4
            "name": "سعيد بن المسيب",
			'url': ''
            ,"_children": [
              {//1  
                "name":   "ابن شهاب الزهري",
                 "url": ""
              },
			  {//2
				"name": "قتادة",
				'url':''
			  }
 
            ]
 
          },
          {//5
            "name": "سعيد المقبري",
			'url':''
            ,"_children": [
              { //1
                "name":   "عبيد الله بن عمر",
                 "url": ""
              }
              ,{  //2
                "name":   "الليث بن سعد",
                 "url": ""
              }
             ,{  //3
                "name":   "محمد بن عبد الرحمان بن أبي ذئب",
                 "url": ""
              },
              {  //4
                "name":   "محمد بن عجلان",
                 "url": ""
              }
            ]
 

          },
          {//6
            "name": "همام بن منبه",
			'url': ''
            ,"_children": [
              {  //1
                "name":   "معمر بن راشد",
                 "url": ""
              }
 
            ]
 
          },
          {//7
            "name": "محمد بن سرين",
			'url': ''
            ,"_children": [
              {  //1
                "name":   "أيوب السختياني",
                 "url": ""
              },
			  {//1
				"name":"هشام بن حسان",
				"url":""
			  }
 
            ]
 
         }

        ]
      },
      {//2
        "name": "عائشة",
		"url":""
        ,"_children": [
          {//1
            "name": "عروة بن زبير",
			"url":""

            ,"_children": [
             {  //1
                "name":   "هاشم بن عروة",
                 "url": ""
              },
			  {//2
				"name": "ابن شهاب الزهري",
				"url": ""
			  }
              ]
			},
			{//2
				"name": "القاسم بن محمد بن أبي بكر الصديق",
				"url": "",
				
				"_children": [
					{//1
						"name": "عبد الرحمان بن قاسم",
						"url": ""
					},
				]
			},
			{//3
				"name": "الأسود بن يزيد النخعي",
				"url": "",
				
				"_children": [
					{//1
						"name": "إبراهيم بن يزيد النخعي",
						"url": ""
					}
				]
			},
			{//4
				"name": "مسروق بن الأجدع",
				"url": "",
				
				"_children": [
					{//1
						"name": "عامر بن شراحيل الشعبي",
						"url": ""
					},
					{//2
						"name": "أبو الضحى مسلم بن صبيح",
						"url": ""
					
					}
				]
			},
			{//5
				"name": "عمرة بنت عبد الرحمن الانصارية",
				"url": ""
			},
			{//6
				"name": "يحيى بن سعيد الانصاري",
				"url": ""
			},
			{//7
				"name": "ابو سلمة",
				"url": "",
				
				"_children": [
					{//1
						"name": "ابن شهاب الزهري",
						"url": ""
					},
					{//2
						"name": "محمد بن عمرو بن علقمة",
						"url": ""
					
					}
				]
				
			},
			
			
		]
		},
		{//3
        "name": "عبد الله بن عمر",
		"url":""
        ,"_children": [
          {//1
            "name": "نافع مولى ابن عمر",
			"url":""

            ,"_children": [
             {  //1
                "name":   "عبيد الله بن عمر",
                 "url": ""
              },
			  {//2
				"name": "أيوب السختياني",
				"url": ""
			  },
			  {  //3
                "name":   "موسى بن عقبة",
                 "url": ""
              },
			  {//4
				"name": "مالك بن أنس",
				"url": ""
			  },
			  {//5
                "name":   "الليث بن سعد",
                 "url": ""
              },
              ]
			},
			{
				"name": "سالم بن عبد الله بن عمر",
				"url": "",
				
				"_children": [
					{
						"name": "ابن شهاب الزهري",
						"url": ""
					},
					{
						"name": "موسى بن عقبة",
						"url": ""
					}
				]
			},
			{
				"name": "عبد الله بن دينار",
				"url": "",
				
				"_children": [
					{
						"name": "مالك بن أنس",
						"url": ""
					},
					{
						"name": "إسماعيل بن جعفر",
						"url": ""
					},
					{
						"name": "سفيان الثوري",
						"url": ""
					}
				]
			}
			
		]
		},
		{//4
        "name": "أنس بن مالك",
		"url":""
        ,"_children": [
          {//1
            "name": "ابن شهاب الزهري",
			"url":""

            ,"_children": [
             {  //1
                "name":   "معمر",
                 "url": ""
              },
			  {//2
				"name": "يونس بن يزيد",
				"url": ""
			  }
              ]
			},
			{//2
				"name": "قتادة بن دعامة السدوسي",
				"url": "",
				
				"_children": [
					{//1
						"name": "سعيدأ بن أبي عروة",
						"url": ""
					},
					{//2
						"name": "هاشم الدستوائي",
						"url": ""
					},
					{//3
						"name": "شعبة",
						"url": ""
					},
					{//4
						"name": "همام",
						"url": ""
					}
					
				]
			},
			{//3
				"name": "ثابت البناني",
				"url": "",
				
				"_children": [
					{//1
						"name": "حماد بن سلمة",
						"url": ""
					},
					{//2
						"name": "حماد بن زيد",
						"url": ""
					},
					{//3
						"name": "سليمان بن مغيرة القيسي",
						"url": ""
					}
				]
			},
			{//4
				"name": "حميد بن أبي حميد الطويل",
				"url": "",
				
				"_children": [
					{//1
						"name": "إسماعيل بن جعفر",
						"url": ""
					},
					{//2
						"name": "حماد بن سلمة",
						"url": ""
					
					},
					{//3
						"name": "خالد بن الحارث الهجيمي",
						"url": ""
					
					}
				]
			}
			
			
		]
		},
	]
	}
]
;

